#include <iostream>
#include <Windows.h>

#include "Funcs.h"
//----------------------------------------------------------------------------------------------
using namespace std;
//----------------------------------------------------------------------------------------------
void run();
//----------------------------------------------------------------------------------------------
int main() {

	run();

}
//----------------------------------------------------------------------------------------------
void run() {
	system("mode con cols=30 lines=7"); //Устанавливает размер окна
	static const TCHAR* myTitle = TEXT("Banking system");
	SetConsoleTitle(myTitle);
	
	//Установка кодировки русского языка
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	int answer;
	cout << "Здравствуйте, войти в систему?\n(1 - да, 0 - нет)" << endl;
	cout << "Ваш выбор: ";
	cin >> answer;
	system("cls"); //Очистка терминала

	if (answer == 1) { //Если пользователь хочет продолжить
		startMenu();
	}
	else if (answer == 0) { //Если пользователь не хочет продолжать
		cout << "~~~~~~~~~~~~~~~~~~~~" << endl;
		cout << "Хорошо, до свидания!" << endl;
	}
	else { //Eсли пльзователь ввёл неправильный ответ
		cout << "~~~~~~~~~~~~~~~~~~" << endl;
		cout << "Error! \nТакого ответа нет!" << endl;
	}

	cout << "~~~~~~~~~~~~~~~~~~~~" << endl;
	system("pause");
	system("mode con cols=84 lines=7"); //Устанавливает размер окна
}
//----------------------------------------------------------------------------------------------