#pragma once
//----------------------------------------------------------------------------------------------
#include <iostream>
#include <string>
#include <Windows.h>
//----------------------------------------------------------------------------------------------
using namespace std;
//----------------------------------------------------------------------------------------------
class Payment
{
public:
	string recipient, sender, paymentName;
	double money;

	Payment();              //Конструктор по умолчанию

	void enterPaymentName();//Метод для ввода имени платежа
	void printInfo();       //Метод для вывода информации о платеже 
};
//----------------------------------------------------------------------------------------------